Revit 2026 API

# DocumentGetElement(ElementId) Method

---

Gets the Element referenced by the input ElementId.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element GetElement(
	ElementId id
)
```
```vb
Public Function GetElement (
	id As ElementId
) As Element
```
```cpp
public:
Element^ GetElement(
	ElementId^ id
)
```
```fsharp
member GetElement :
        id : ElementId -> Element
```

#### Parameters

id ElementId
     The ElementId, whose referenced Element will be retrieved from the model.

#### Return Value

Element The element referenced by the input argument.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

will be returned if the input ElementId doesn't reference to a valid Element.

#### Reference

Document Class

GetElement Overload

Autodesk.Revit.DB Namespace